{"pageProps":{"post":{"title":"Cómo usar gcloud con un cliente","date":"2021-02-17T01:28:38.247Z","slug":"clientes-gcloud","content":"<p>Actualmente mi estrategia de venta consiste en delegarle los costos de infraestructura al cliente si así lo desean. Para que los pagos puedan venir de la tarjeta de crédito del cliente, es necesario que éste se registre en google cloud. Mi proceso de desarrollo implica una primera etapa en la que construyo un prototipo y una parte de la infraestructura en google cloud, y luego transfiero todo lo que creé al cliente. </p>\n<p><a href=\"https://cloud.google.com/billing/docs/how-to/modify-project\">Fuente de toda esta información</a></p>\n<blockquote>\n<p><strong>Paso previo: cambiar el idioma</strong>\nPara cambiar el idioma, hay que ir al menú superior derecho (3 puntitos) > preferences > lanuage &#x26; region</p>\n</blockquote>\n<p>Cada <em>persona</em> que se registra en google cloud tiene vinculada una <em>billing account</em>. Cada <em>proyecto</em> tiene <strong>1</strong> <em>billing account</em>, y una <em>billing account</em> puede tener <strong>muchos</strong> <em>proyectos</em>.</p>\n<h1>Proceso general para pasar los gastos al cliente</h1>\n<ol>\n<li>El desarrollador <strong>crea</strong> el <em>proyecto</em>, prototipa sobre éste proyecto, puede realizar una pequeña inversión.</li>\n<li>El cliente se registra en <a href=\"https://cloud.google.com\">cloud.google.com</a></li>\n<li>El cliente va al menú <strong>\"sandwich\"</strong> (3 líneas) superior izquierdo > <strong>Billing</strong> (tarjeta de crédito) > <strong>Account management</strong> (engranaje)</li>\n<li>En la barra derecha se muestra toda la información de acceso de cualquier cosa de google cloud. El cliente debe hacer click en <strong>+ADD MEMBER</strong>.</li>\n<li>El cliente pone en <strong>\"New members\"</strong> el mail del desarrollador.</li>\n<li>El cliente Hace click en <strong>Role</strong> y luego donde dice \"Type to filter\", escribe <strong>\"Billing Account User\"</strong>, y lo concede al desarrollador haciendo click en <strong>SAVE</strong></li>\n<li>El desarrollador va a <strong>sandwich</strong> > <strong>Billing</strong> > <strong>Account management</strong>, y clickea en <strong>\"Actions\"</strong> > <strong>\"Change billing\"</strong> del proyecto a transferir. Allí va a poder elegir la billing account del cliente.</li>\n<li>(PENDIENTE VERIFICAR SI FUNCIONA) El cliente ahora puede desactivar el rol que me concedió sobre su Billing Account para evitar que el desarrollador (malintencionadamente o por error) agregue más proyectos a su billing account</li>\n</ol>\n<h1>Proceso para pasar el proyecto al cliente</h1>\n<p>El desarrollador que creó el proyecto por defecto tiene rol <strong>Owner</strong> en el mismo. Para darle visibilidad absoluta al cliente sobre la infraestructura, debe el desarrollador debe asignarle ese mismo rol al cliente.\n1. Loggearse en la <a href=\"(https://console.cloud.google.com)\">consola de google cloud</a>\n2. Hamburguesa->IAM\n3. Click en el botón \"ADD\"\n4. Aparece un formulario, en \"New members\" poner el mail del cliente, en Role poner \"Owner\"</p>\n"}},"__N_SSG":true}