{"pageProps":{"post":{"title":"Cómo comunicarse","date":"2021-02-16T21:14:49.258Z","slug":"comunicacion","content":"<p>Viví situaciones comunicativas muy distintas a lo largo de mi vida:</p>\n<ul>\n<li>En mi adolescencia nos mudamos a Brasil, tuve que aprender portugués muy rápido para poder rendir bien.</li>\n<li>Durante varios años fui a misionar con <a href=\"https://mvg.com.ar\">jornadas</a> a Lavalle, Corrientes. En esta situación es necesario transmitir conceptos importantes en un lenguaje muy distinto, y en muy poco tiempo.</li>\n<li>Trabajé escasísimos 2 años y medio en empresas de software.</li>\n</ul>\n<p>Esto es lo que aprendí. Nótese que en este post no cito bibliografía.</p>\n<h1>1. Las palabras se pagan</h1>\n<p>Las palabras son caras en muchos sentidos. Las paga el que las escribe y el que las lee; el que las escucha y el que las dice. Hay que elegirlas bien para minimizar su cantidad y maximizar la efectividad del mensaje. Es conveniente repensar un mensaje de chat o mail para asegurarnos de que el texto escrito realmente transmite información.</p>\n<h1>2. <a href=\"https://es.wikipedia.org/wiki/Analfabetismo_funcional\">Analfabetismo funcional</a></h1>\n<p>No es lo mismo saber leer una señal en la calle que saber leer un artículo de un diario. No es lo mismo escribir tu nombre que escribir un cuento corto, o un texto argumentativo. Poner palabras una al lado de la otra no es lo mismo que escribir un texto. En diversas situaciones, tenemos que comunicarnos con personas que manejan peor el lenguaje. Para que la comunicación sea efectiva, es necesario adaptarse al receptor.</p>\n<p>Algunas estrategias:</p>\n<ul>\n<li>Usar Ejemplos</li>\n<li>Usar Analogías o metáforas</li>\n<li>Simplificar el lenguaje</li>\n<li>Reducir el uso de la palabra escrita. Pueden usarse diagramas, videos, juegos, experimentos, etc.</li>\n<li>Escribir un mensaje más corto o hablar menos</li>\n<li>Reducir la cantidad de temas o conceptos explicados en un mismo texto o conversación. Dejar algún tema para más tarde o para otro día.</li>\n</ul>\n<h1>3. Empatía</h1>\n<p>Independientemente de la habilidad con que se maneje de la palabra escrita, es casi imposible comunicarse con alguien que no empatiza. El emisor debe intentar meterse en la cabeza del receptor para entender cómo va a ser interpretado el mensaje. Para esto es bueno pensar en quién es el receptor y para qué va a usar esta información el receptor. Las palabras que se emiten, se emiten <em>para</em> el receptor: tienen que ser como una artesanía o un mueble hecho a medida.</p>\n<h1>4. Sinónimos</h1>\n<p>Los sinónimos debilitan el mensaje y hay que evitarlos. Es mejor decidirse por la palabra más precisa en vez de enumerar varias similares. Sobre todo en textos técnicos, donde cada palbra tiene un significado muy preciso, los sinónimos necesariamente confunden. En otros textos, se usan para evitar sonidos repetitivos y estéticamente desagradables. Es importante que el texto sea efectivo, no que sea estético.</p>\n<h1>5. Diagramas</h1>\n<p>Los diagramas transmiten ideas que el texto no puede. Los diagramas son muy superiores a la prosa para explicar absolutamente cualquier cosa. Intentá escribir la menor cantidad de texto posible y usar la mayor cantidad posible de diagramas. Mi herramienta favorita es <code>draw.io</code> (ahora llamada <a href=\"https://diagrams.net/\">diagrams.net</a>).</p>\n<h1>6. Lógica y evidencias</h1>\n<p>La información verdadera emana de fuentes confiables o de un razonamiento válido, basado en información verdadera. Cuando algo que digas o escribas no cumpla estas condiciones, tenés que avisar. De esta manera, todo lo que decís es verdadero. Si, para cumplir esto, abusás de frases como \"creo que\", \"me parece\", \"no estoy seguro\", etc; lo más conveniente es guardar silencio.</p>\n"}},"__N_SSG":true}